Revit 2027 API
Application.NewProjectTemplateDocument Method
 New project template document
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Document NewProjectTemplateDocument(
	string templateFilename
)
Public Overridable Function NewProjectTemplateDocument (
	templateFilename As String
) As Document
public:
virtual Document^ NewProjectTemplateDocument(
	String^ templateFilename
)
abstract NewProjectTemplateDocument :
        templateFilename : string -> Document
override NewProjectTemplateDocument :
        templateFilename : string -> Document
Parameters
templateFilename String
The template file name.
Return Value
Document
Exceptions
Exception | Condition
ArgumentException | If 'templateFileName' is null or an empty string.
InvalidOperationException | If the project template document cannot be created.
Remarks
 This command corresponds to New->Project->Project Template command in the user-interface.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace